## Titanic : Machine Learning from Disaster

`test.csv` 파일을 읽어 데이터프레임 객체로 변환한 후 아래 문제들을 해결해보시오.

---

### Ref.
https://www.kaggle.com/datasets/shuofxz/titanic-machine-learning-from-disaster

### Level.1
---

1. `pandas`를 사용하여 `train.csv` 파일 데이터를 불러와 **DataFrame**으로 저장하시오.

In [2]:
from sklearn.datasets import load_diabetes
import pandas as pd

df = pd.read_csv('train.csv')
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

2. 저장된 데이터에서 상위 5개 행을 출력하시오.

3. 각 열의 이름, 결측치 여부, 데이터 타입(`dtype`)을 한 번에 확인하시오.

4. `Age`(나이), `Fare`(요금) 열의 평균값, 최솟값, 최댓값을 구하시오.

5. 탑승객 중 생존자와 사망자가 각각 몇 명인지 계산하시오.
- 생존자 : `Survived`=1 / 사망자 : `Survived`=0

6. 객실 등급(`Pclass`)별로 탑승객이 몇 명인지 계산하시오.

7. 나이가 50세 이상인 탑승객만 추출하여 새로운 데이터프레임을 만드시오.

8. 탑승객을 나이대 기준으로 그룹화하여 새로운 열 `AgeGroup`을 추가한 후, 상위 5개 행을 확인하시오.
    - 13세 -> 10대 그룹에 속함. 28세 -> 20대 그룹에 속함

### Level.2
---

9. 성별(`Sex`)과 객실 등급(`Pclass`)을 기준으로 그룹화하여 각각의 평균 생존율을 계산하시오.

10. 나이대별 평균 생존율을 계산하시오.

11. 각 열에 존재하는 결측치(`NaN`)의 총 개수와 전체 데이터 대비 비율을 계산하여 내림차순으로 출력하시오.

12. `Age` 열의 결측치를 승객들의 나이 중앙 값으로 채우세요. (원본 프레임에 적용)

13. `Sex`열의 **'male'**은 0으로, **'female'**은 1로 변경하여 **Gender_Encoded**라는 새로운 열을 추가하시오.

14. 탑승지(`Embarked`)별로 승객이 지불한 요금(`Fare`)의 평균을 계산하시오.

15. `Pclass`를 인덱스로, `Sex`를 컬럼으로, 값으로 `Fare`의 평균을 사용하여 **피벗 테이블**을 생성하시오.

16. `SibSp` (형제/배우자 수)와 `Parch` (부모/자녀 수)를 합산하여 `FamilySize` 열을 추가하고, 이 열의 요약 통계를 확인하세요.

17. `Name` 열에서 호칭(Mr., Miss, Mster.)을 정규 표현식 또는 문자열 함수를 사용하여 추출하고 `Title`이라는 새로운 열을 생성한 뒤, 가장 흔한 5개의 호칭을 출력하시오.

18. 생존한 사람과 사망한 사람의 나이(`Age`) 분포를 비교할 수 있도록 시각화하시오.

### Level. 3
---

19. `Age` 열의 결측치를 단순히 전체 평균/중앙값으로 채우지 않고, 추출한 `Title`과 `Pclass`를 동시에 고려하여 해당 그룹의 나이 중앙값으로 대치하시오.
    - ex. 'Master' 타이틀을 가진 1등급 승객 그룹의 나이 중앙값으로 해당 그룹의 결측치를 채움

20. `Survived`, `Pclass`, `Age`, `SibSp`, `Parch`, `Fare` 등의 수치형 변수들 간의 상관관계 행렬을 계산하고, 그 결과를 **히트맵(Heatmap)** 으로 시각화하시오.
    - hint. corr() : 상관관계 행렬 계산 함수